import numpy as np

arr = np.array([10,20,30,40,50])
# print(arr)
# print(type(arr))
# print(arr[0])
# print(arr[1])
# print(arr[-1])
# print(arr[1:4])
# print(arr[:3])
# print(arr[2:])
# print(arr.shape)
# print(arr.size)
# print(arr.ndim)

# matrix = np.array([
#     [1,2,3],
#     [4,5,6]
# ])
# print(matrix)
# print(matrix.shape)
# print(matrix.ndim)
# print(matrix[0])
# print(matrix[1])
# print(matrix[0][1])
# print(matrix[1,2])
# zeros = np.zeros((3,3))
# ones = np.ones((3,3))
# full = np.full((3,3),2)
# print(zeros)
# print(ones)
# print(full)
# a = np.arange(1,11)
# print(a)
# b = np.arange(0,20,2)
# print(b)
# arr = np.array([1,2,3,4,5])
# print(arr + 10)
# print(arr * 2)
# print(arr - 1)
# print(arr / 2)
# a = np.array([1,2,3])
# b = np.array([4,5,6])
# print(a + b)
# print(a * b)
# sum()
# mean()
# max()
# min()
# arr = np.array([1,2,3,4,5])
# print(arr.sum())
# print(arr.mean())
# print(arr.max())
# print(arr.min())

# 1.Задание 
# Создать массив из 5 чисел
# вывести первый элемент
# Вывести последний элемент
# Вывести срез со 2 по 4 элемент

# 2.Задание
# # Создать массив от 1 до 10
# Умножить все элементы на 3 
# Прибавить ко всем 5

# 3.Задание
# Создать двумерный массив 2х3
# вывести первую строку
# вывести последний элемент
# вывести shape 

# 4.Задание
# Для массива чисел найти:
# Сумму
# Среднее
# Максимальное
# Минимальное